blog/16.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP. 2.2.3
#+subtitle: 2023-05-17 Wed
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)
#+latex_header:

* Sequences as Conventional Interfaces
Data abstraction permits us to: i) design programs without dealing
with details of data representation; ii) experiment with alternative
representations. This section introduces another powerful design
principle fro working with data structures: /conventional interfaces/.

The authors presents two procedures that, on the surface, seem very
difference. However, they notice, when looking at them more carefully,
one can see great similarity. The first one computes the sum of the
squares of the odd leaves of a tree. The second one constructs a list
of all the even Fibonacci numbers up to ~n~.

#+begin_src scheme
  (define (sum-odd-squares tree)
    (cond ((null? tree) 0)
          ((not (pair? tree))
           (if (odd? tree) (square tree) 0))
          (else (+ (sum-odd-squares
                    (car tree))
                   (sum-odd-squares
                    (cdr tree))))))
#+end_src

#+begin_src scheme
  (define (even-fibs n)
    (define (next k)
      (if (> k n)
          nil
          (let ((f (fib k)))
            (if (even? f)
                (cons f (next (+ k 1)))
                (next (+ k 1))))))
    (next 0))
#+end_src

Although those two functions don't look very similar, at a certain
level of abstraction, they are.

The first procedure:
- *enumerates* the leaves of a tree;
- *filters* them, selecting the odd ones;
- *squares* each of the selected ones; and
- *accumulates* the result using +, starting with 0.

The second procedure:
- *enumerates* the integers from 0 to n;
- *computes* the Fibonacci number for each integer;
- *filters* them, selecting the even ones; and
- *accumulates* the result using ~cons~, starting with the empty list.

These processes can be described in terms of ``signals flowing through
a cascade of stages''.

#+begin_src
  +-------------+   +-------------+   +-------------+   +-------------+
  | enumerate:  |-->| filter:     |-->| map:        |-->| accumulate: |
  | tree leaves |   | odd?        |   | square      |   | +, 0        |
  +-------------+   +-------------+   +-------------+   +-------------+

  +-------------+   +-------------+   +-------------+   +-------------+
  | enumerate:  |-->| map:        |-->| filter:     |-->| accumulate: |
  | integers    |   | fib         |   | even?       |   | cons, ()    |
  +-------------+   +-------------+   +-------------+   +-------------+

(Figure from SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007))
#+end_src

However, our two procedures fail to exhbit the signal-flow structure
just described. If they did show such a structure, then we would
achieve greater conceptual clarity. The authors show how to do it.
~Filter~, ~accumulate~, (and ~enumerate-tree~ and ~even-fibs~) are
therefore introduced.

#+begin_quote
The key to organizing programs so as to more clearly reflect the
signal-flow structure is to concentrate on the “signals” that flow
from one stage in the process to the next. If we represent these
signals as lists, then we can use list operations to implement the
processing at each of the stages (p. 115)
#+end_quote

#+begin_quote
The value of expressing programs as sequence operations is that this
helps us make program designs that are modular, that is, designs that
are constructed by combining relatively independent pieces. (p. 117)
#+end_quote

#+begin_src scheme 
  (define (filter predicate sequence)
    (cond ((null? sequence) nil)
          ((predicate (car sequence))
           (cons (car sequence)
                 (filter predicate 
                         (cdr sequence))))
          (else  (filter predicate 
                         (cdr sequence)))))

  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op 
                        initial 
                        (cdr sequence)))))

  (define (enumerate-interval low high)
    (if (> low high)
        nil
        (cons low 
              (enumerate-interval 
               (+ low 1) 
               high))))

  (define (enumerate-tree tree)
    (cond ((null? tree) nil)
          ((not (pair? tree)) (list tree))
          (else (append 
                 (enumerate-tree (car tree))
                 (enumerate-tree (cdr tree))))))

  (define (sum-odd-squares tree)
    (accumulate 
     +
     0
     (map square
          (filter odd?
                  (enumerate-tree tree)))))

  (define (list-fib-squares n)
    (accumulate 
     cons
     nil
     (map square
          (map fib
               (enumerate-interval 0 n)))))

  (define 
    (product-of-squares-of-odd-elements sequence)
    (accumulate 
     *
     1
     (map square (filter odd? sequence))))
#+end_src

#+begin_quote
Modular construction is a powerful strategy for controlling complexity
in engineering design. (p. 117)
#+end_quote

#+begin_quote
Sequences, implemented here as lists, serve as a conventional
interface that permits us to combine processing modules. (p. 118)
#+end_quote

The authors then present /nested mappings/ as an example of extending
``the sequence paradigm to include many computation that are commonly
expressed using nested loops''.

