blog/16.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-17 Wed 23:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP. 2.2.3</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP. 2.2.3
<br />
<span class="subtitle">2023-05-17 Wed</span>
</h1>

<div id="outline-container-org3cd1d07" class="outline-2">
<h2 id="org3cd1d07">Sequences as Conventional Interfaces</h2>
<div class="outline-text-2" id="text-org3cd1d07">
<p>
Data abstraction permits us to: i) design programs without dealing
with details of data representation; ii) experiment with alternative
representations. This section introduces another powerful design
principle fro working with data structures: <i>conventional interfaces</i>.
</p>

<p>
The authors presents two procedures that, on the surface, seem very
difference. However, they notice, when looking at them more carefully,
one can see great similarity. The first one computes the sum of the
squares of the odd leaves of a tree. The second one constructs a list
of all the even Fibonacci numbers up to <code>n</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">sum-odd-squares</span> tree)
  (<span style="color: #b9ca4a;">cond</span> ((null? tree) 0)
        ((not (pair? tree))
         (<span style="color: #b9ca4a;">if</span> (odd? tree) (square tree) 0))
        (<span style="color: #b9ca4a;">else</span> (+ (sum-odd-squares
                  (car tree))
                 (sum-odd-squares
                  (cdr tree))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">even-fibs</span> n)
  (<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">next</span> k)
    (<span style="color: #b9ca4a;">if</span> (&gt; k n)
        nil
        (<span style="color: #b9ca4a;">let</span> ((f (fib k)))
          (<span style="color: #b9ca4a;">if</span> (even? f)
              (cons f (next (+ k 1)))
              (next (+ k 1))))))
  (next 0))
</pre>
</div>

<p>
Although those two functions don't look very similar, at a certain
level of abstraction, they are.
</p>

<p>
The first procedure:
</p>
<ul class="org-ul">
<li><b>enumerates</b> the leaves of a tree;</li>
<li><b>filters</b> them, selecting the odd ones;</li>
<li><b>squares</b> each of the selected ones; and</li>
<li><b>accumulates</b> the result using +, starting with 0.</li>
</ul>

<p>
The second procedure:
</p>
<ul class="org-ul">
<li><b>enumerates</b> the integers from 0 to n;</li>
<li><b>computes</b> the Fibonacci number for each integer;</li>
<li><b>filters</b> them, selecting the even ones; and</li>
<li><b>accumulates</b> the result using <code>cons</code>, starting with the empty list.</li>
</ul>

<p>
These processes can be described in terms of ``signals flowing through
a cascade of stages''.
</p>

<pre class="example">
  +-------------+   +-------------+   +-------------+   +-------------+
  | enumerate:  |--&gt;| filter:     |--&gt;| map:        |--&gt;| accumulate: |
  | tree leaves |   | odd?        |   | square      |   | +, 0        |
  +-------------+   +-------------+   +-------------+   +-------------+

  +-------------+   +-------------+   +-------------+   +-------------+
  | enumerate:  |--&gt;| map:        |--&gt;| filter:     |--&gt;| accumulate: |
  | integers    |   | fib         |   | even?       |   | cons, ()    |
  +-------------+   +-------------+   +-------------+   +-------------+

(Figure from SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007))
</pre>

<p>
However, our two procedures fail to exhbit the signal-flow structure
just described. If they did show such a structure, then we would
achieve greater conceptual clarity. The authors show how to do it.
<code>Filter</code>, <code>accumulate</code>, (and <code>enumerate-tree</code> and <code>even-fibs</code>) are
therefore introduced.
</p>

<blockquote>
<p>
The key to organizing programs so as to more clearly reflect the
signal-flow structure is to concentrate on the “signals” that flow
from one stage in the process to the next. If we represent these
signals as lists, then we can use list operations to implement the
processing at each of the stages (p. 115)
</p>
</blockquote>

<blockquote>
<p>
The value of expressing programs as sequence operations is that this
helps us make program designs that are modular, that is, designs that
are constructed by combining relatively independent pieces. (p. 117)
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">filter</span> predicate sequence)
  (<span style="color: #b9ca4a;">cond</span> ((null? sequence) nil)
        ((predicate (car sequence))
         (cons (car sequence)
               (filter predicate 
                       (cdr sequence))))
        (<span style="color: #b9ca4a;">else</span>  (filter predicate 
                       (cdr sequence)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">accumulate</span> op initial sequence)
  (<span style="color: #b9ca4a;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op 
                      initial 
                      (cdr sequence)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">enumerate-interval</span> low high)
  (<span style="color: #b9ca4a;">if</span> (&gt; low high)
      nil
      (cons low 
            (enumerate-interval 
             (+ low 1) 
             high))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">enumerate-tree</span> tree)
  (<span style="color: #b9ca4a;">cond</span> ((null? tree) nil)
        ((not (pair? tree)) (list tree))
        (<span style="color: #b9ca4a;">else</span> (append 
               (enumerate-tree (car tree))
               (enumerate-tree (cdr tree))))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">sum-odd-squares</span> tree)
  (accumulate 
   +
   0
   (<span style="color: #b9ca4a;">map</span> square
        (filter odd?
                (enumerate-tree tree)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">list-fib-squares</span> n)
  (accumulate 
   cons
   nil
   (<span style="color: #b9ca4a;">map</span> square
        (<span style="color: #b9ca4a;">map</span> fib
             (enumerate-interval 0 n)))))

(<span style="color: #b9ca4a;">define</span> 
  (product-of-squares-of-odd-elements sequence)
  (accumulate 
   *
   1
   (<span style="color: #b9ca4a;">map</span> square (filter odd? sequence))))
</pre>
</div>

<blockquote>
<p>
Modular construction is a powerful strategy for controlling complexity
in engineering design. (p. 117)
</p>
</blockquote>

<blockquote>
<p>
Sequences, implemented here as lists, serve as a conventional
interface that permits us to combine processing modules. (p. 118)
</p>
</blockquote>

<p>
The authors then present <i>nested mappings</i> as an example of extending
``the sequence paradigm to include many computation that are commonly
expressed using nested loops''.
</p>
</div>
</div>
