blog/16.org
* Exercise 2.33
*Exercise*:

Fill in the missing expressions to complete the following definitions
of some basic list-manipulation operations as accumulations:

#+begin_src scheme
  (define (map p sequence)
    (accumulate (lambda (x y) ⟨??⟩) 
                nil sequence))

  (define (append seq1 seq2)
    (accumulate cons ⟨??⟩ ⟨??⟩))

  (define (length sequence)
    (accumulate ⟨??⟩ 0 sequence))
#+end_src

*Answer*:

To warmup, here is how you can use accumulate to return the list
itself:
#+begin_src scheme
  (define (list-identity sequence)
    (accumulate (lambda (x y) (cons x y)) nil sequence))
#+end_src

Given ~list-identity~, it's easy to write ~map~:
#+begin_src scheme
  (define (map p sequence)
    (accumulate (lambda (x y) (cons (p x) y)) nil sequence))
#+end_src

Append:
#+begin_src scheme
  (define (append seq1 seq2)
    (accumulate cons seq2 seq1))
#+end_src

Length:
#+begin_src scheme
  (define (length sequence)
    (accumulate (lambda (x y) (+ 1 y)) 0 sequence))
#+end_src

* Exercise 2.35
*Exercise*:

#+begin_quote
Redefine count-leaves from 2.2.2 as an accumulation:

#+begin_src scheme
  (define (count-leaves t)
    (accumulate <??>
                <??>
                (map <??> <??>)))
#+end_src
#+end_quote

*Answer*:

The following solution uses ~map~ to ~fringe~ each member of ~t~ which
is a pair, producing a list of atoms and one-level-lists; then it uses
~accumulate~ to sum each member treated as a 1 if it's an atom or as
the length of itself if it's a list.
#+begin_src scheme
  (define (map proc items)
    (if (null? items)
        nil
        (cons (proc (car items))
              (map proc (cdr items)))))

  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op
                        initial
                        (cdr sequence)))))

  (define (append list1 list2)
    (if (null? list1)
        list2
        (cons (car list1)
              (append (cdr list1)
                      list2))))
  (define (fringe x)
    (cond ((null? x) nil)
          ((not (pair? x)) (list x))
          (else (append (fringe (car x))
                        (fringe (cdr x))))))

  (define (length l)
    (if (null? l)
        0
        (+ 1 (length (cdr l)))))

  (define (gp-length l)
    (if (not (pair? l))
        1
        (length l)))

  (define (gp-count-leaves t)
    (accumulate (lambda (a b)
                  (+ (gp-length a)
                     b))
                0
                (map fringe t)))

  (gp-count-leaves '(1 (2) (((3 4 5)) 4)))
#+end_src

This above was my solution. I've been told another, better, solution:
#+begin_src scheme
  (define (dean-count-leaves t)
    (accumulate +
                0
                (map
                 (lambda (x) (if (pair? x)
                                 (dean-count-leaves x)
                                 1)) t)))
#+end_src

* Exercise 2.36
*Exercise*:

#+begin_quote
The procedure ~accumulate-n~ is similar to ~accumulate~ except that it
takes as its third argument a sequence of sequences, which are all
assumed to have the same number of elements. It applies the designated
accumulation procedure to combine all the first elements of the
sequences, all the second elements of the sequences, and so on, and
returns a sequence of the results. For instance, if s is a sequence
containing four sequences, ~((1 2 3) (4 5 6) (7 8 9) (10 11 12))~,
then the value of ~(accumulate-n + 0 s)~ should be the sequence ~(22
26 30)~. Fill in the missing expressions in the following definition
of ~accumulate-n~:

#+begin_src scheme
  (define (accumulate-n op init seqs)
    (if (null? (car seqs))
        nil
        (cons (accumulate op init ⟨??⟩)
              (accumulate-n op init ⟨??⟩))))
#+end_src
#+end_quote

*Answer*:

#+begin_src scheme
  (define (accumulate-n op init seqs)
    (if (null? (car seqs))
        nil
        (cons (accumulate op init (map car seqs))
              (accumulate-n op init (map cdr seqs)))))
#+end_src

* Exercise 2.38
*Exercise*:

#+begin_quote
The accumulate procedure is also known as ~fold-right~, because it
combines the first element of the sequence with the result of
combining all the elements to the right. There is also a ~fold-left~,
which is similar to ~fold-right~, except that it combines elements
working in the opposite direction:

#+begin_src scheme
  (define (fold-left op initial sequence)
    (define (iter result rest)
      (if (null? rest)
          result
          (iter (op result (car rest))
                (cdr rest))))
    (iter initial sequence))
#+end_src

What are the values of

#+begin_src scheme
  (fold-right / 1 (list 1 2 3))
  (fold-left  / 1 (list 1 2 3))
  (fold-right list nil (list 1 2 3))
  (fold-left  list nil (list 1 2 3))
#+end_src

Give a property that op should satisfy to guarantee that ~fold-right~
and ~fold-left~ will produce the same values for any sequence.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (fold-right op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (fold-right op initial (cdr sequence)))))

  (fold-right / 1 (list 1 2 3))
  ;; (/ 1 (/ 2 (/ 3 1)))

  (fold-right list nil (list 1 2 3))
  ;; (list 1 (list 2 (list 3 nil)))

  (define (fold-left op initial sequence)
    (define (iter result rest)
      (if (null? rest)
          result
          (iter (op result (car rest))
                (cdr rest))))
    (iter initial sequence))

  (fold-left / 1 (list 1 2 3))
  (/ (/ (/ 1 1) 2) 3)

  (fold-left list nil (list 1 2 3))
  ;; (list (list (list nil 1) 2) 3)
#+end_src

