blog/16.html

<div id="outline-container-org715b054" class="outline-2">
<h2 id="org715b054">Exercise 2.33</h2>
<div class="outline-text-2" id="text-org715b054">
<p>
<b>Exercise</b>:
</p>

<p>
Fill in the missing expressions to complete the following definitions
of some basic list-manipulation operations as accumulations:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">map</span> p sequence)
  (accumulate (<span style="color: #b9ca4a;">lambda</span> (x y) &#10216;??&#10217;) 
              nil sequence))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">append</span> seq1 seq2)
  (accumulate cons &#10216;??&#10217; &#10216;??&#10217;))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">length</span> sequence)
  (accumulate &#10216;??&#10217; 0 sequence))
</pre>
</div>

<p>
<b>Answer</b>:
</p>

<p>
To warmup, here is how you can use accumulate to return the list
itself:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">list-identity</span> sequence)
  (accumulate (<span style="color: #b9ca4a;">lambda</span> (x y) (cons x y)) nil sequence))
</pre>
</div>

<p>
Given <code>list-identity</code>, it's easy to write <code>map</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">map</span> p sequence)
  (accumulate (<span style="color: #b9ca4a;">lambda</span> (x y) (cons (p x) y)) nil sequence))
</pre>
</div>

<p>
Append:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">append</span> seq1 seq2)
  (accumulate cons seq2 seq1))
</pre>
</div>

<p>
Length:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">length</span> sequence)
  (accumulate (<span style="color: #b9ca4a;">lambda</span> (x y) (+ 1 y)) 0 sequence))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc51a09" class="outline-2">
<h2 id="orgbc51a09">Exercise 2.35</h2>
<div class="outline-text-2" id="text-orgbc51a09">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Redefine count-leaves from 2.2.2 as an accumulation:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">count-leaves</span> t)
  (accumulate <span style="color: #7aa6da;">&lt;??&gt;</span>
              <span style="color: #7aa6da;">&lt;??&gt;</span>
              (<span style="color: #b9ca4a;">map</span> <span style="color: #7aa6da;">&lt;??&gt;</span> <span style="color: #7aa6da;">&lt;??&gt;</span>)))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
The following solution uses <code>map</code> to <code>fringe</code> each member of <code>t</code> which
is a pair, producing a list of atoms and one-level-lists; then it uses
<code>accumulate</code> to sum each member treated as a 1 if it's an atom or as
the length of itself if it's a list.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">map</span> proc items)
  (<span style="color: #b9ca4a;">if</span> (null? items)
      nil
      (cons (proc (car items))
            (<span style="color: #b9ca4a;">map</span> proc (cdr items)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">accumulate</span> op initial sequence)
  (<span style="color: #b9ca4a;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op
                      initial
                      (cdr sequence)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">append</span> list1 list2)
  (<span style="color: #b9ca4a;">if</span> (null? list1)
      list2
      (cons (car list1)
            (append (cdr list1)
                    list2))))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">fringe</span> x)
  (<span style="color: #b9ca4a;">cond</span> ((null? x) nil)
        ((not (pair? x)) (list x))
        (<span style="color: #b9ca4a;">else</span> (append (fringe (car x))
                      (fringe (cdr x))))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">length</span> l)
  (<span style="color: #b9ca4a;">if</span> (null? l)
      0
      (+ 1 (length (cdr l)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">gp-length</span> l)
  (<span style="color: #b9ca4a;">if</span> (not (pair? l))
      1
      (length l)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">gp-count-leaves</span> t)
  (accumulate (<span style="color: #b9ca4a;">lambda</span> (a b)
                (+ (gp-length a)
                   b))
              0
              (<span style="color: #b9ca4a;">map</span> fringe t)))

(gp-count-leaves '(1 (2) (((3 4 5)) 4)))
</pre>
</div>

<p>
This above was my solution. I've been told another, better, solution:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">dean-count-leaves</span> t)
  (accumulate +
              0
              (<span style="color: #b9ca4a;">map</span>
               (<span style="color: #b9ca4a;">lambda</span> (x) (<span style="color: #b9ca4a;">if</span> (pair? x)
                               (dean-count-leaves x)
                               1)) t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8349bbe" class="outline-2">
<h2 id="org8349bbe">Exercise 2.36</h2>
<div class="outline-text-2" id="text-org8349bbe">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The procedure <code>accumulate-n</code> is similar to <code>accumulate</code> except that it
takes as its third argument a sequence of sequences, which are all
assumed to have the same number of elements. It applies the designated
accumulation procedure to combine all the first elements of the
sequences, all the second elements of the sequences, and so on, and
returns a sequence of the results. For instance, if s is a sequence
containing four sequences, <code>((1 2 3) (4 5 6) (7 8 9) (10 11 12))</code>,
then the value of <code>(accumulate-n + 0 s)</code> should be the sequence <code>(22
26 30)</code>. Fill in the missing expressions in the following definition
of <code>accumulate-n</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">accumulate-n</span> op init seqs)
  (<span style="color: #b9ca4a;">if</span> (null? (car seqs))
      nil
      (cons (accumulate op init &#10216;??&#10217;)
            (accumulate-n op init &#10216;??&#10217;))))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">accumulate-n</span> op init seqs)
  (<span style="color: #b9ca4a;">if</span> (null? (car seqs))
      nil
      (cons (accumulate op init (<span style="color: #b9ca4a;">map</span> car seqs))
            (accumulate-n op init (<span style="color: #b9ca4a;">map</span> cdr seqs)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org190578d" class="outline-2">
<h2 id="org190578d">Exercise 2.38</h2>
<div class="outline-text-2" id="text-org190578d">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The accumulate procedure is also known as <code>fold-right</code>, because it
combines the first element of the sequence with the result of
combining all the elements to the right. There is also a <code>fold-left</code>,
which is similar to <code>fold-right</code>, except that it combines elements
working in the opposite direction:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">fold-left</span> op initial sequence)
  (<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">iter</span> result rest)
    (<span style="color: #b9ca4a;">if</span> (null? rest)
        result
        (iter (op result (car rest))
              (cdr rest))))
  (iter initial sequence))
</pre>
</div>

<p>
What are the values of
</p>

<div class="org-src-container">
<pre class="src src-scheme">(fold-right / 1 (list 1 2 3))
(fold-left  / 1 (list 1 2 3))
(fold-right list nil (list 1 2 3))
(fold-left  list nil (list 1 2 3))
</pre>
</div>

<p>
Give a property that op should satisfy to guarantee that <code>fold-right</code>
and <code>fold-left</code> will produce the same values for any sequence.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">fold-right</span> op initial sequence)
  (<span style="color: #b9ca4a;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (fold-right op initial (cdr sequence)))))

(fold-right / 1 (list 1 2 3))
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(/ 1 (/ 2 (/ 3 1)))</span>

(fold-right list nil (list 1 2 3))
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(list 1 (list 2 (list 3 nil)))</span>

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">fold-left</span> op initial sequence)
  (<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">iter</span> result rest)
    (<span style="color: #b9ca4a;">if</span> (null? rest)
        result
        (iter (op result (car rest))
              (cdr rest))))
  (iter initial sequence))

(fold-left / 1 (list 1 2 3))
(/ (/ (/ 1 1) 2) 3)

(fold-left list nil (list 1 2 3))
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(list (list (list nil 1) 2) 3)</span>
</pre>
</div>
</div>
</div>
