blog/16.org
* Exercise 2.39
*Exercise*:

#+begin_quote
Complete the following definitions of ~reverse~ (Exercise 2.18) in
terms of ~fold-right~ and ~fold-left~ from Exercise 2.38:

#+begin_src scheme
  (define (reverse sequence)
    (fold-right 
     (lambda (x y) ⟨??⟩) nil sequence))

  (define (reverse sequence)
    (fold-left 
     (lambda (x y) ⟨??⟩) nil sequence))
#+end_src
#+end_quote

*Answer*:

#+begin_src scheme
  (define (reverse seq)
    (fold-right (lambda (x y) (append y (list x)))
                nil
                seq))

  (define (reverse seq)
    (fold-left (lambda (x y) (append (list y) x))
               nil
               seq))
#+end_src

* Exercise 2.40
*Exercise*:

#+begin_quote
Define a procedure ~unique-pairs~ that, given an integer ~n~,
generates the sequence of pairs ~(i,j)~ with $1 \leq j < i \leq
n$. Use ~unique-pairs~ to simplify the definition of ~prime-sum-pairs~
given above.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (unique-pairs n)
    (flatmap
     (lambda (i)
       (map (lambda (j)
              (list i j))
            (enumerate-interval
             1
             (- i 1))))
     (enumerate-interval 1 n)))

  (define (prime-sum-pairs n)
    (map make-pair-sum
         (filter
          prime-sum?
          (unique-pairs n))))
#+end_src

* Exercise 2.41
*Exercise*:

#+begin_quote
Write a procedure to find all ordered triples of distinct positive
integers /i/, /j/, and /k/ less than or equal to a given integer /n/
that sum to a given integer /s/.
#+end_quote

*Answer*:

- We can:
  - enumerate all ordered triples (see below how);
  - filter them;

- In order to enumerate all triples:
  - for each element /e/, enumerate all the possible pairs from 1 to
    /n/ without using /e/, and then adjoin /e/ to the front of each
    pair.

- In order to enumerate all possible pairs from 1 to /n/:
  - for each element /e/ of the range from 1 to /n/, enumerate all
    other elements of the range, and for each of those other elements
    create the list ~(e other-element)~.

#+begin_src scheme
  (define (accumulate op initial seq)
    (if (null? seq)
        initial
        (op (car seq)
            (accumulate op initial (cdr seq)))))

  (define (filter predicate seq)
    (cond ((null? seq) nil)
          ((predicate (car seq))
           (cons (car seq) (filter predicate (cdr seq))))
          (else (filter predicate (cdr seq)))))

  (define (enumerate-interval low high)
    (if (> low high)
        nil
        (cons low
              (enumerate-interval
               (+ low 1)
               high))))

  (define (enumerate-interval-except low high not-allowed)
    (filter (lambda (x) (not (= x not-allowed)))
            (enumerate-interval low high)))

  ;; create a list of all possible pairs given a sequence
  (define (all-pairs seq)
    (accumulate
     append
     nil
     (map (lambda (x)
            (map (lambda (y)
                   (cons x (list y)))
                 (filter (lambda (e) (not (= e x))) seq)))
          seq)))

  ;; all triples from 1 to n
  (define (all-triples n)
    (accumulate
     append
     nil
     (map (lambda (x)
            (map (lambda (y) (cons x y))
                 (all-pairs (enumerate-interval-except 1 n x))))
          (enumerate-interval 1 n))))

  (define (all-triples-sum n sum)
    (filter (lambda (x)
              (= (+ (car x)
                    (car (cdr x))
                    (car (cdr (cdr x))))
                 sum))
            (all-triples n)))

  (all-triples-sum 56 8)
  ;; => ((1 2 5) (1 3 4) (1 4 3) (1 5 2) (2 1 5) (2 5 1) (3 1 4) (3 4 1) (4 1 3) (4 3 1) (5 1 2) (5 2 1))
#+end_src

* Exercise 2.42
*Answer*:

#+begin_src scheme
  (define (filter pred seq)
    (cond ((null? seq) nil)
          ((pred (car seq)) (cons (car seq) (filter pred (cdr seq))))
          (else (filter pred (cdr seq)))))

  (define (accumulate op initial seq)
    (if (null? seq)
        initial
        (op (car seq)
            (accumulate op initial (cdr seq)))))

  (define (flatmap op seq)
    (accumulate append nil (map op seq)))

  (define (enumerate-interval low high)
    (if (> low high)
        nil
        (cons low (enumerate-interval (+ low 1) high))))

  (define (safe? k poss)
    (let ((queen (car (filter
                       (lambda (q)
                         (= (car (cdr q)) k))
                       poss))))
      (if (> (length
              (filter
               (lambda (p)
                 (or (= (car queen)
                        (car p))
                     (= (- (car p) (car queen))
                        (- (car (cdr p)) (car (cdr queen))))
                     (= (- (car p) (car queen))
                        (- (car (cdr queen)) (car (cdr p))))))
               poss))
             1)
          #f
          #t)))

  (define (adjoin-position nr k rq)
    (cons (list nr k) rq))

  (define empty-board nil)

  (define (queens board-size)
    (define (queen-cols k)
      (if (= k 0)
          (list empty-board)
          (filter
           (lambda (positions) (safe? k positions))
           (flatmap
            (lambda (rest-of-queens)
              (map (lambda (new-row)
                     (adjoin-position new-row k rest-of-queens))
                   (enumerate-interval 1 board-size)))
            (queen-cols (- k 1))))))
    (queen-cols board-size))
#+end_src

#+begin_export html
<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
#+end_export
