blog/16.html

<div id="outline-container-org25b9a3b" class="outline-2">
<h2 id="org25b9a3b">Exercise 2.39</h2>
<div class="outline-text-2" id="text-org25b9a3b">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Complete the following definitions of <code>reverse</code> (Exercise 2.18) in
terms of <code>fold-right</code> and <code>fold-left</code> from Exercise 2.38:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">reverse</span> sequence)
  (fold-right 
   (<span style="color: #b9ca4a;">lambda</span> (x y) &#10216;??&#10217;) nil sequence))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">reverse</span> sequence)
  (fold-left 
   (<span style="color: #b9ca4a;">lambda</span> (x y) &#10216;??&#10217;) nil sequence))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">reverse</span> seq)
  (fold-right (<span style="color: #b9ca4a;">lambda</span> (x y) (append y (list x)))
              nil
              seq))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">reverse</span> seq)
  (fold-left (<span style="color: #b9ca4a;">lambda</span> (x y) (append (list y) x))
             nil
             seq))
</pre>
</div>
</div>
</div>

<div id="outline-container-org281982e" class="outline-2">
<h2 id="org281982e">Exercise 2.40</h2>
<div class="outline-text-2" id="text-org281982e">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Define a procedure <code>unique-pairs</code> that, given an integer <code>n</code>,
generates the sequence of pairs <code>(i,j)</code> with \(1 \leq j < i \leq
n\). Use <code>unique-pairs</code> to simplify the definition of <code>prime-sum-pairs</code>
given above.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">unique-pairs</span> n)
  (flatmap
   (<span style="color: #b9ca4a;">lambda</span> (i)
     (<span style="color: #b9ca4a;">map</span> (<span style="color: #b9ca4a;">lambda</span> (j)
            (list i j))
          (enumerate-interval
           1
           (- i 1))))
   (enumerate-interval 1 n)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">prime-sum-pairs</span> n)
  (<span style="color: #b9ca4a;">map</span> make-pair-sum
       (filter
        prime-sum?
        (unique-pairs n))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgabcca3d" class="outline-2">
<h2 id="orgabcca3d">Exercise 2.41</h2>
<div class="outline-text-2" id="text-orgabcca3d">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Write a procedure to find all ordered triples of distinct positive
integers <i>i</i>, <i>j</i>, and <i>k</i> less than or equal to a given integer <i>n</i>
that sum to a given integer <i>s</i>.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li>We can:
<ul class="org-ul">
<li>enumerate all ordered triples (see below how);</li>
<li>filter them;</li>
</ul></li>

<li>In order to enumerate all triples:
<ul class="org-ul">
<li>for each element <i>e</i>, enumerate all the possible pairs from 1 to
<i>n</i> without using <i>e</i>, and then adjoin <i>e</i> to the front of each
pair.</li>
</ul></li>

<li>In order to enumerate all possible pairs from 1 to <i>n</i>:
<ul class="org-ul">
<li>for each element <i>e</i> of the range from 1 to <i>n</i>, enumerate all
other elements of the range, and for each of those other elements
create the list <code>(e other-element)</code>.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">accumulate</span> op initial seq)
  (<span style="color: #b9ca4a;">if</span> (null? seq)
      initial
      (op (car seq)
          (accumulate op initial (cdr seq)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">filter</span> predicate seq)
  (<span style="color: #b9ca4a;">cond</span> ((null? seq) nil)
        ((predicate (car seq))
         (cons (car seq) (filter predicate (cdr seq))))
        (<span style="color: #b9ca4a;">else</span> (filter predicate (cdr seq)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">enumerate-interval</span> low high)
  (<span style="color: #b9ca4a;">if</span> (&gt; low high)
      nil
      (cons low
            (enumerate-interval
             (+ low 1)
             high))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">enumerate-interval-except</span> low high not-allowed)
  (filter (<span style="color: #b9ca4a;">lambda</span> (x) (not (= x not-allowed)))
          (enumerate-interval low high)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">create a list of all possible pairs given a sequence</span>
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">all-pairs</span> seq)
  (accumulate
   append
   nil
   (<span style="color: #b9ca4a;">map</span> (<span style="color: #b9ca4a;">lambda</span> (x)
          (<span style="color: #b9ca4a;">map</span> (<span style="color: #b9ca4a;">lambda</span> (y)
                 (cons x (list y)))
               (filter (<span style="color: #b9ca4a;">lambda</span> (e) (not (= e x))) seq)))
        seq)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">all triples from 1 to n</span>
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">all-triples</span> n)
  (accumulate
   append
   nil
   (<span style="color: #b9ca4a;">map</span> (<span style="color: #b9ca4a;">lambda</span> (x)
          (<span style="color: #b9ca4a;">map</span> (<span style="color: #b9ca4a;">lambda</span> (y) (cons x y))
               (all-pairs (enumerate-interval-except 1 n x))))
        (enumerate-interval 1 n))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">all-triples-sum</span> n sum)
  (filter (<span style="color: #b9ca4a;">lambda</span> (x)
            (= (+ (car x)
                  (car (cdr x))
                  (car (cdr (cdr x))))
               sum))
          (all-triples n)))

(all-triples-sum 56 8)
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; ((1 2 5) (1 3 4) (1 4 3) (1 5 2) (2 1 5) (2 5 1) (3 1 4) (3 4 1) (4 1 3) (4 3 1) (5 1 2) (5 2 1))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e6acfe" class="outline-2">
<h2 id="org2e6acfe">Exercise 2.42</h2>
<div class="outline-text-2" id="text-org2e6acfe">
<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">filter</span> pred seq)
  (<span style="color: #b9ca4a;">cond</span> ((null? seq) nil)
        ((pred (car seq)) (cons (car seq) (filter pred (cdr seq))))
        (<span style="color: #b9ca4a;">else</span> (filter pred (cdr seq)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">accumulate</span> op initial seq)
  (<span style="color: #b9ca4a;">if</span> (null? seq)
      initial
      (op (car seq)
          (accumulate op initial (cdr seq)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">flatmap</span> op seq)
  (accumulate append nil (<span style="color: #b9ca4a;">map</span> op seq)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">enumerate-interval</span> low high)
  (<span style="color: #b9ca4a;">if</span> (&gt; low high)
      nil
      (cons low (enumerate-interval (+ low 1) high))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">safe?</span> k poss)
  (<span style="color: #b9ca4a;">let</span> ((queen (car (filter
                     (<span style="color: #b9ca4a;">lambda</span> (q)
                       (= (car (cdr q)) k))
                     poss))))
    (<span style="color: #b9ca4a;">if</span> (&gt; (length
            (filter
             (<span style="color: #b9ca4a;">lambda</span> (p)
               (<span style="color: #b9ca4a;">or</span> (= (car queen)
                      (car p))
                   (= (- (car p) (car queen))
                      (- (car (cdr p)) (car (cdr queen))))
                   (= (- (car p) (car queen))
                      (- (car (cdr queen)) (car (cdr p))))))
             poss))
           1)
        #f
        #t)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">adjoin-position</span> nr k rq)
  (cons (list nr k) rq))

(<span style="color: #b9ca4a;">define</span> <span style="color: #e78c45;">empty-board</span> nil)

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">queens</span> board-size)
  (<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">queen-cols</span> k)
    (<span style="color: #b9ca4a;">if</span> (= k 0)
        (list empty-board)
        (filter
         (<span style="color: #b9ca4a;">lambda</span> (positions) (safe? k positions))
         (flatmap
          (<span style="color: #b9ca4a;">lambda</span> (rest-of-queens)
            (<span style="color: #b9ca4a;">map</span> (<span style="color: #b9ca4a;">lambda</span> (new-row)
                   (adjoin-position new-row k rest-of-queens))
                 (enumerate-interval 1 board-size)))
          (queen-cols (- k 1))))))
  (queen-cols board-size))
</pre>
</div>

<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</span></p>
</div>
</body>
</html>
